Revit 2027 API
SlantedColumnFailures Properties
The BuiltInFailures.SlantedColumnFailures type exposes the following members.
Properties
Name | Description
CannotCutParallelToLocationCurve |  Cut plane of slanted column end is parallel to the location curve.
SlantedColumnCannotCutEnd |  Unable to trim slanted column end geometry to desired condition.
SlantedColumnCannotCutEndWarn |  Unable to trim slanted column end geometry to desired condition.
Top
See Also
Reference
BuiltInFailures.SlantedColumnFailures Class
Autodesk.Revit.DB Namespace